[
    {
        "title": "Live updates: Russia's war in Ukraine - cnn.com",
        "href": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-03-29-23/index.html",
        "body": "A locomotive depot in the Russian-occupied city of Melitopol in southern Ukraine was hit by Ukrainian shelling Wednesday morning, the city's administration said. The Melitopol city administration..."
    },
    {
        "title": "Russia-Ukraine war | Today's latest from Al Jazeera",
        "href": "https://www.aljazeera.com/tag/ukraine-russia-crisis/",
        "body": "As the Rus­sia-Ukraine war en­ters its 394th day, we take a look at the main de­vel­op­ments. 24 Mar 2023 Ze­len­skyy calls on EU to give jets, mis­siles or ex­pect a long war Ukraine..."
    },
    {
        "title": "Russia-Ukraine war: List of key events, day 399 | Russia-Ukraine war ...",
        "href": "https://www.aljazeera.com/news/2023/3/29/russia-ukraine-war-list-of-key-events-day-399",
        "body": "As the Russia-Ukraine war enters its 399th day, we take a look at the main developments. Ukraine's President Volodymyr Zelenskyy walking along trenches with border guard officers as he inspects..."
    },
    {
        "title": "Russia-Ukraine war: UN warns of 'very dangerous' situation at ...",
        "href": "https://www.theguardian.com/world/live/2023/mar/28/russia-ukraine-war-live-news-updates-multiple-russian-drones-shot-down-over-kyiv-blasts-attack",
        "body": "Ukraine is aiming to exhaust and inflict heavy losses on Russian forces trying to capture the small eastern city of Bakhmut, the commander of Ukrainian ground forces has said."
    },
    {
        "title": "Russia's invasion of Ukraine in maps — latest updates",
        "href": "https://www.ft.com/content/4351d5b0-0888-4b47-9368-6bc4dfbccbf5",
        "body": "On February 24 last year, the world awoke to news that Russian tanks had rolled into Ukraine from the east and north. Troops had been massing on Ukraine's borders for months and Russian leader..."
    },
    {
        "title": "Ukraine in maps: Tracking the war with Russia - BBC News",
        "href": "https://www.bbc.com/news/world-europe-60506682",
        "body": "Russia's invasion began with dozens of missile strikes on cities all over Ukraine before dawn on 24 February 2022. Russian ground troops moved in quickly and within a few weeks were in control..."
    },
    {
        "title": "Russia-Ukraine war: List of key events, day 397 | Russia-Ukraine war ...",
        "href": "https://www.aljazeera.com/news/2023/3/27/russia-ukraine-war-list-of-key-events-day-397",
        "body": "As the Russia-Ukraine war enters its 397th day, we take a look at the main developments. The Ukrainian crew of a Mi-24 fighting helicopter prepares to take off for a mission against Russian ..."
    },
    {
        "title": "Russia-Ukraine War | Casualties, Map, Causes, & Significance",
        "href": "https://www.britannica.com/event/2022-Russian-invasion-of-Ukraine",
        "body": "On February 24, 2022, Russia launched a full-scale invasion of Ukraine. Although Russian forces made significant gains in the first days of combat, Ukrainian defenders rebuffed attempts to seize Kyiv and other major cities and were soon launching counterattacks at Russian positions."
    },
    {
        "title": "Has Putin's war failed and what does Russia want from Ukraine?",
        "href": "https://www.bbc.com/news/world-europe-56720589",
        "body": "Russia-Ukraine war; Media caption, Watch: Ukraine's recapture of Kherson City was one of Russia's biggest setbacks . By Paul Kirby. BBC News. When Vladimir Putin sent up to 200,000 soldiers into ..."
    },
    {
        "title": "Key Moments in the Russia-Ukraine War: A Timeline - The New York Times",
        "href": "https://www.nytimes.com/article/ukraine-russia-war-timeline.html",
        "body": "How Russia's war in Ukraine has unfolded, month by month. A timeline of Russia's full-scale invasion of Ukraine, which began one year ago. Send any friend a story."
    }
]